cool/tutorials/incompressible/simpleFoam/motorBike/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-5 -4 0)
    (15 -4 0)
    (15  4 0)
    (-5  4 0)
    (-5 -4 8)
    (15 -4 8)
    (15  4 8)
    (-5  4 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 8 8) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch frontAndBack
    (
        (3 7 6 2)
        (1 5 4 0)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    wall lowerWall
    (
        (0 3 2 1)
    )
    patch upperWall
    (
        (4 5 6 7)
    )
);

// ************************************************************************* //
